# Join and Row & Column Bind

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Create the 2 DataFrames based on the following raw data

In [2]:
daf1 = {
        'ID' :[1,2,3,4],
        'Name':['Aryan' , 'Basitro' , 'Rose' , 'John'],
        'Score':[99,66,44,33]}

daf2 = {
        'ID' :[5,6,7,8] ,
        'Name' :['Michelle' , 'Ramiro' , 'Vignesh' , 'Damon'],
        'Score':[78,55,77,87]}

### Step 3. Assign each to a variable called data1, data2

In [3]:
data1 = pd.DataFrame(daf1)
data2 = pd.DataFrame(daf2)

data2

   ID      Name  Score
0   5  Michelle     78
1   6    Ramiro     55
2   7   Vignesh     77
3   8     Damon     87

### Step 4. Join the two dataframes along rows and assign all_data

In [4]:
all_data = pd.concat([data1, data2])
all_data

   ID      Name  Score
0   1     Aryan     99
1   2   Basitro     66
2   3      Rose     44
3   4      John     33
0   5  Michelle     78
1   6    Ramiro     55
2   7   Vignesh     77
3   8     Damon     87

### Step 5. Join the two dataframes along columns and assing to all_data_col

In [5]:
all_data_col = pd.concat([data1, data2], axis = 1)
all_data_col

   ID     Name  Score  ID      Name  Score
0   1    Aryan     99   5  Michelle     78
1   2  Basitro     66   6    Ramiro     55
2   3     Rose     44   7   Vignesh     77
3   4     John     33   8     Damon     87

### Step 7. Create new dataset for Merge

In [6]:
data3 = pd.DataFrame(
        {'Id': ['1','2','3','4','5'], 
        'Name': ['Aryan','Rose','Bran','Shiv','Joy']})

data4 = pd.DataFrame(
        {'Id':['1','2','6','7','8'],
         'Score':[40, 60, 80, 90, 70]})
data4

  Id  Score
0  1     40
1  2     60
2  6     80
3  7     90
4  8     70

### Step 8. Merge only the data that has the same 'id' on both data1 and data2

In [7]:
# Inner Join
pd.merge(data3,data4, on = 'Id',how ='inner')

  Id   Name  Score
0  1  Aryan     40
1  2   Rose     60

### Step 9. Merge all values in data1 and data2, with matching records from both sides where available.

In [8]:
# Full Outer Join
pd.merge(data3,data4, on= 'Id', how = 'outer')

  Id   Name  Score
0  1  Aryan   40.0
1  2   Rose   60.0
2  3   Bran    NaN
3  4   Shiv    NaN
4  5    Joy    NaN
5  6    NaN   80.0
6  7    NaN   90.0
7  8    NaN   70.0

In [9]:
# Left Outer Join
pd.merge(data3,data4, on= 'Id', how='left')

  Id   Name  Score
0  1  Aryan   40.0
1  2   Rose   60.0
2  3   Bran    NaN
3  4   Shiv    NaN
4  5    Joy    NaN

In [10]:
# Left Outer Join
pd.merge(data3,data4, on= 'Id', how='right')

  Id   Name  Score
0  1  Aryan     40
1  2   Rose     60
2  6    NaN     80
3  7    NaN     90
4  8    NaN     70